app/Controllers/Api.php

SELECT *
FROM "datalokasiobjek"
WHERE "datalokasiobjek"."deleted_at" IS NULL
---
    public function index()
    {
        $dataobjek = $this->tabeldatalokasiobjek->findAll();