app/Controllers/Home.php

SELECT *
FROM "datalokasiobjek"
WHERE "datalokasiobjek"."deleted_at" IS NULL
---
    public function table()
    {
        $data['dataobjek'] = $this->tabeldatalokasiobjek->findAll();